import "./style.css"
import { useEffect } from "react";
import animateScrollTo from 'animated-scroll-to';

const Article = () => {

    useEffect(() => {
        animateScrollTo(0)
    }, [])

    return (
        <div className="container mx-auto my-10">
            <div className="text-black ctext-xl font-bold">Что читать на карантине если очень очень скучно?</div>
            <div className="text-grey ctext-base font-medium mt-2">23.02.2021</div>
            <img className="article-img float-right h-80 object-cover ml-8" src="https://img.freepik.com/free-photo/lovely-asian-young-lady-portriat-happy-woman-lifestyle-concept_1150-9025.jpg?size=626&ext=jpg" alt="article-img" />
            <div className="text-grey-dark ctext-base font-medium">
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
            </div>
            <br />
            <img className="article-img float-left h-80 object-cover mr-8" src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR8ukNV33M9aitikWF2NT2oIghcBC8R2-ZnoA&usqp=CAU" alt="article-img" />
            <div className="text-grey-dark ctext-base font-medium">
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
                Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье. Книга об изменениях тела, которая поможет девочкам обрести уверенность в себе. Автор в формате коротких ироничных эссе дает полезные советы на темы, связанные с физиологией, которые не принято открыто обсуждать в обществе и семье.
            </div>
        </div>
    )
}

export default Article;