import { useEffect } from "react";
import  animateScrollTo  from 'animated-scroll-to';

const Oferta = () => {

    useEffect(() => {
        animateScrollTo(0)
    }, [])

    return (
        <div className="container mx-auto my-10">
            <div className="text-black ctext-xl font-bold pb-8">Договор оферты</div>
            <div className="text-grey-dark ctext-base whitespace-pre-wrap">
                3.1. Администратор предоставляет Пользователю до его регистрации на Сайте доступ к информации о Сайте, курсах, программах обучения, о библиотеке курсов, о бесплатных занятиях, а также доступ к обзорам и статьям, размещенным на сайте в разделе «Полезные материалы» по сетевому​  ​ адресу​  ​ http://netology.ru/blog​ .
                <br />
                3.2. После регистрации на Сайте Пользователю в дополнение к доступу, указанному в пункте 3.1 Соглашения, предоставляется доступ к бесплатным занятиям, предоставляется возможность приобретения за плату доступа к программам обучения и к библиотеке курсов, доступ и участие в рейтинге Пользователей, возможность зарегистрироваться в качестве Корпоративного пользователя с целью приобретения для Конечного потребителя доступа к библиотеке курсов, а также​  ​ доступ​  ​ к​  ​ иным​  ​ функциям​  ​ Сайта​  ​ и​  ​ Личного​  ​ кабинета,​  ​ предоставляемым​  ​ явно.
                <br />
                3.3. После того, как Пользователь заполнил все необходимые поля формы регистрации на Сайте по сетевому адресу ​ https://netology.ru/navigation?modal=sign_up​ , Администратор в автоматическом режиме направляет на адрес электронной почты, указанный Пользователем, письмо со ссылкой, перейдя по которой Пользователь должен придумать и подтвердить пароль от Личного кабинета и завершить​  ​ регистрацию.
                <br />
                3.4. По завершении регистрации на Сайте Пользователю предоставляется доступ к Личному кабинету по учетным данным – адресу электронной почты и паролю. Пароль может быть изменен Пользователем​  ​ в​  ​ любое​  ​ время​  ​ после​  ​ регистрации.
                <br />
                3.5. В случае оформления Пользователем заказа на доступ к Библиотеке курсов для Конечных потребителей, Пользователь автоматически регистрируется на Сайте как Корпоративный пользователь​  ​ с​  ​ доступом​  ​ к​  ​ Личному​  ​ кабинету​  ​ по​  ​ прежним​  ​ учетным​  ​ данным.
                <br />
                3.6. На Пользователе лежит обязанность обеспечить безопасность и сохранность пароля. При утрате либо компрометации пароля, а также в случае незаконного завладения третьими лицами доступа к Личному кабинету, Пользователь обязан незамедлительно сообщить об этом Администратору по телефону +7 (495) 540-55-28 либо на адрес электронной почты support@netology.ru​ . До момента поступления такого сообщения все действия, совершенные с использованием Личного кабинета Пользователя будут считаться совершенными самим Пользователем.
                <br />
                <br />
                <br />

                4. ПОРЯДОК​  ​ ПОЛЬЗОВАНИЯ​  ​ ЛИЧНЫМ​  ​ КАБИНЕТОМ​  ​ И​  ​ САЙТОМ
                <br />
                4.1. По завершении регистрации Пользователь получает доступ к Личному кабинету. В Личном кабинете Пользователя отображается информация о начатых и завершенных Пользователем курсах и программах обучения, о возможности доступа Пользователя к Библиотеке курсов за плату и к бесплатным занятиям, о стимулирующих мероприятиях, о партнерах Администратора, предоставляющих Пользователям бесплатно или со скидкой указанные по сетевому адресу https://netology.ru/student/gifts товары и/или услуги, о предлагаемых вакансиях партнеров Администратора, о произведенных платежах в счет оплаты доступа к библиотеке курсов и программам​  ​ обучения.
                <br />
                4.2. В Личном кабинете Пользователь имеет возможность оплатить доступ к библиотеке курсов и программам​  ​ обучения.
                <br />
                4.3. Пользователю доступны статьи и иные материалы, представленные на Сайте, возможность оставлять​  ​ комментарии​  ​ к​  ​ таким​  ​ статьям​  ​ и​  ​ материалам.
                <br />
                4.4. Для доступа к определенным курсам, программам обучения и бесплатным занятиям от Пользователя может потребоваться соблюдение специальных технических требований Администратора,​  ​ размещенных​  ​ на​  ​ Сайте.
                <br />
                4.5. Администратор вправе в любое время по своему усмотрению в отношении курсов и программ обучения, в том числе в отношении бесплатных занятий, изменять темы отдельных занятий, менять содержание занятий, количество, наименование и вид материалов, входящих в состав курсов, программ обучения, бесплатных занятий, даты и время проведения соответствующих занятий и их продолжительность, а также, в случае необходимости, заменять Преподавателей по отдельным занятиям. При этом случае Администратор гарантирует, что подобные изменения не приведут к ухудшению качества курсов, программ обучения и бесплатных занятий. Информация о таких изменениях публикуется на Сайте непосредственно до начала проведения соответствующего занятия,​  ​ в​  ​ котором​  ​ произошли​  ​ такие​  ​ изменения.
                <br />
                4.6. Пользователь имеет возможность участвовать в партнерской программе Администратора на условиях и в порядке, определенных Администратором и указанных на соответствующей странице Сайта.
                <br />
                4.7. Корпоративный пользователь не имеет доступа к программам обучения, а также возможности оплачивать​  ​ курсы​  ​ для​  ​ осуществления​  ​ самостоятельного​  ​ доступа​  ​ к​  ​ ним.
                <br />
                4.8. Положения пунктов 4.1., 5.1., 6.1. Соглашения применяются с учетом положений пункта 4.7. Соглашения.
                <br />
                4.9. Пользователь обязан пользоваться Сайтом и Личным кабинетом добросовестно, не нарушая законодательство Российской Федерации, права и свободы третьих лиц, нормы морали и нравственности. В случае необходимости Корпоративный пользователь обязуется обеспечить соблюдение законодательства Российской Федерации, норм морали и нравственности Конечными потребителями.
                <br />
                <br />
                <br />


                5. УСЛОВИЯ​  ​ И​  ​ ПОРЯДОК​  ​ ДОСТУПА​  ​ К​  ​ ВИДЕОКУРСАМ
                <br />
                5.1. Пользователю доступна информация о каждом видеокурсе, его описание, о темах и продолжительности занятий, о продолжительности курса, Преподавателях курса, количестве и составе слушателей курса, количестве и названии материалов (аудиовизуальных, текстовых, графических) в составе курса, о количестве и составе слушателей, уже прошедших курс, о рейтинге курса. Пользователю доступна информация о стоимости курсов и доступна возможность оплаты​  ​ каждого​  ​ видеокурса.
                <br />
                5.2. Доступ к каждому видеокурсу предоставляется Пользователям, оплатившим в порядке, установленном Соглашением и указанном на соответствующей странице Сайта, стоимость видеокурса.​  ​ Доступ​  ​ предоставляется​  ​ через​  ​ личный​  ​ кабинет.
                <br />
                5.3. Курсы предусматривают видеолекции и программные средства в виде теста для проверки Пользователем усвоенной информации, предоставленной в видеолекции. Тестирование происходит в автоматическом режиме программными средствами Сайта. Положительным результатом тестирования является выбор Пользователем правильного ответа из числа предложенных.
                <br />
                5.4. В случае положительных результатов всех тестов курса, Пользователю предоставляется сертификат о прохождении курса с указанием темы курса, а также имени и фамилии Пользователя в​  ​ соответствии​  ​ с​  ​ данными​  ​ из​  ​ Личного​  ​ кабинета.
                <br />
                5.5 По завершению курса Пользователь вправе оценить курс и оставить комментарий о курсе. Администратор оставляет за собой право удалить комментарии Пользователей, признанные Администратором​  ​ противоречащими​  ​ законодательству​  ​ Российской​  ​ Федерации.
                <br />
                <br />
                <br />


                6. ПОРЯДОК​  ​ ДОСТУПА​  ​ К​  ​ ПРОГРАММАМ​  ​ ОБУЧЕНИЯ
                <br />
                6.1. Пользователю доступна информация о программах обучения, их краткое описание, описание в виде часто задаваемых вопросов и ответов, информация о Преподавателях программы обучения, о составе программы обучения, содержащей наименование, продолжительность, состав каждого из этапов (тем) программы обучения, включающей количество и название занятий, дату и время их проведения, информацию о Преподавателях по таким занятиям. Пользователю доступна подробная информация о каждом занятии программы обучения, описание его теоретической и практической части, а также навыках, которые предлагается освоить Пользователю в рамках такого занятия.
                <br />
                Доступ к программам обучения предоставляется Пользователям, оплатившим такой доступ в установленном Соглашением и соответствующей офертой, расположенной по сетевому адресу https://netology.ru/legal ,​ порядке.
                <br />
                6.2. Программы обучения, на которые Пользователь зарегистрировался, но которые не оплатил, отображаются в Личном кабинете как неоплаченные. Программы обучения, на которые Пользователь зарегистрировался и которые оплатил, доступны в Личном кабинете в полном объеме​  ​ со​  ​ всеми​  ​ соответствующими​  ​ материалами​  ​ с​  ​ учетом​  ​ предстоящих​  ​ и​  ​ пройденных​  ​ занятий.
                <br />
                6.4. Каждое занятие программы обучения представляет собой вебинар, дата и время проведения которого отображается на соответствующей странице на Сайте и в Личном кабинете, а также иные материалы, в том числе средства проверки приобретенных навыков в виде теста. Прошедшие вебинары сохраняются в Личном кабинете в виде видеозаписей в течение 1 (одного) месяца с даты проведения последнего занятия (вебинара) программы обучения. Участие пользователя в вебинаре, просмотр видеозаписи вебинаров, доступ к материалам и прохождение тестов осуществляется​  ​ посредством​  ​ Личного​  ​ кабинета.
                <br />
                6.5. Пользователь после каждого занятия программы обучения, предполагающего выполнение практической работы, выполняет практическую работу и отправляет результат Преподавателю посредством Личного кабинета в течение 5 (пяти) рабочих дней со дня проведения такого занятия.Преподаватель направляет комментарии к такой выполненной Пользователем практической работе посредством Личного кабинета в течение 7 (семи) рабочих дней с даты получения такой работы,​  ​ либо​  ​ в​  ​ иной​  ​ срок.
                <br />
                6.6. В отношении каждого занятия программы обучения могут быть предусмотрены методические материалы, содержащие список литературы, рекомендуемой для усвоения информации, полученной Пользователем в таком занятии. При этом Стороны признают и понимают, что такой список литературы не является рекламой. Указанные материалы доступны Пользователю, оплатившему соответствующую программу обучения в течение проведения программы обучения и после​  ​ –​  ​ в​  ​ течение​  ​ срока,​  ​ устанавливаемого​  ​ Администратором.
                <br />
                6.7. Пользователь проверяет приобретенные при помощи программы обучения навыки и знания по освоению специальности, указанной в теме программы обучения, выполняя итоговую работу в рамках​  ​ программы​  ​ обучения.
                <br />
                6.8. Пользователь при создании итоговой работы, результатов выполненных задач по семинарам (вебинарам) обязуется соблюдать права третьих лиц, не использовать результаты интеллектуальной деятельности, правообладателем которых он не является и для использования которых​  ​ необходимо​  ​ разрешение​  ​ правообладателя.
                <br />
                <br />
                <br />


                7. ПОРЯДОК​  ​ ДОСТУПА​  ​ К​  ​ БЕСПЛАТНЫМ​  ​ ЗАНЯТИЯМ
                <br />
                7.1. Информация о предстоящих бесплатных занятиях, темах таких занятий, дате и времени их проведения, Преподавателях и количестве участников размещается на соответствующей странице Сайта.
                <br />
                7.2. Пользователь имеет возможность зарегистрироваться на предстоящее бесплатное занятие, перейдя по ссылке «Записаться» и заполнив регистрационную форму. Об успешной регистрации на бесплатное занятие Пользователь информируется сообщением в открывшейся после перехода по ссылке странице Сайта и сообщением, направленным на указанный в Личном кабинете адрес электронной почты. Персональная ссылка для участия Пользователя в бесплатном занятии направляется Пользователю за 1 (один) рабочий день до начала такого занятия на указанный​  ​ в​  ​ Личном​  ​ кабинете​  ​ адрес​  ​ электронной​  ​ почты.
                <br />
                7.3. Информация о прошедших бесплатных занятиях, содержащих видеозапись вебинара бесплатного занятия и иные материалы бесплатного занятия, равно как и темы таких занятий, дата и время их проведения, Преподаватели и количество участников размещаются на соответствующей​  ​ странице​  ​ Сайта.
                <br />
                7.4. Пользователь имеет возможность ознакомиться с информацией о прошедшем бесплатном занятии, его описании, просмотреть видеозапись вебинара бесплатного занятия, загрузить на устройство​  ​ Пользователя​  ​ материалы​  ​ бесплатного​  ​ занятия.
                <br />
                <br />
                <br />


                8.​  ​ КОРПОРАТИВНОЕ​  ​ ОБУЧЕНИЕ
                <br />
                8.1. Корпоративное обучение (корпоративная подписка) - раздел Сайта, расположенный по сетевому адресу https://netology.ru/enterprise​ . Посредством использования функционала данного раздела Корпоративный пользователь может оформить и оплатить подписку на все представленные на Сайте видеокурсы для Конечных пользователей в количестве от 5 (пяти) до 50 (пятидесяти)​  ​ человек.
                <br />
                8.2. После оплаты подписки для выбранного Корпоративным пользователем количества Конечных  пользователей и на выбранный срок, Корпоративный пользователь получает права администратора для распределения доступов к видеокурсам для оплаченного количества Конечных​  ​ пользователей.
                <br />
                8.3.​  ​ Срок​  ​ доступа​  ​ к​  ​ видеокурсам​  ​ равен​  ​ сроку​  ​ доступа​  ​ по​  ​ подписке.
                <br />
                <br />
                <br />


                9.​  ​ ПОРЯДОК​  ​ ДОСТУПА​  ​ К​  ​ СТАТЬЯМ.​  ​ ПУБЛИКАЦИЯ​  ​ В​  ​ РАЗДЕЛЕ​  ​ СТАТЬИ
                <br />
                9.1. В разделе Статьи Пользователи а также любые иные третьи лица могут ознакомиться с информационными и информационно-аналитическими материалами, публикуемыми в разделе. Доступ​  ​ к​  ​ таким​  ​ материалам​  ​ не​  ​ ограничен.
                <br />
                9.2. Пользователь, желающий опубликовать свои материалы в разделе Статьи, должен ознакомиться с условиями публикации, подать заявку на публикацию в разделе, согласовать свои материалы​  ​ с​  ​ редактором​  ​ раздела.
                <br />
                9.3.​  ​ Пользователь,​  ​ материалы​  ​ которого​  ​ опубликованы​  ​ в​  ​ разделе​  ​ Статьи,​  ​ является​  ​ Автором.
                <br />
                9.4. Публикация прошедших согласование с редактором раздела материалов производится Администратором по своему усмотрению и на безвозмездной основе, то есть без взимания платы с Автора. Администратор вправе отказать Пользователю в публикации как несогласованных, так и  предварительно​  ​ согласованных​  ​ с​  ​ редактором​  ​ раздела​  ​ материалов​  ​ без​  ​ объяснения​  ​ причин.
                <br />
                9.5. Пользователь понимает и соглашается с тем, что Администратор не выплачивает и не обязуется​  ​ выплатить​  ​ Авторам​  ​ какое-либо​  ​ вознаграждение​  ​ за​  ​ публикацию​  ​ материалов.
                <br />
                <br />
                <br />


                10.​  ​ ЦЕНТР​  ​ РАЗВИТИЯ​  ​ КАРЬЕРЫ
                <br />
                10.1. Центр развития карьеры предназначен для помощи Пользователям, успешно окончившим программы обучения, в профессиональной ориентации, а также для помощи работодателям (юридическим лицам и индивидуальным предпринимателям) в поиске работников среди Пользователей,​  ​ успешно​  ​ окончивших​  ​ программы​  ​ обучения.
                <br />
                <br />
                10.2. Пользователи, работодатели, а также любые третьи лица вправе задать Администратору любой вопрос относительно профориентации и поиска работы, нажав кнопку “Написать сообщение”​  ​ и​  ​ заполнив​  ​ все​  ​ необходимые​  ​ поля​  ​ формы.
                <br />
                10.3.​  ​ Администратор​  ​ вправе​  ​ не​  ​ отвечать​  ​ на​  ​ вопрос​  ​ без​  ​ объяснения​  ​ причин.
                <br />
                10.4. Нажимая кнопку “Отправить” в форме “Сообщение в центр развития карьеры” физическое лицо, указавшее в данной форме свои персональные данные (имя и e-mail), дает согласие на обработку таких персональных данных Администратором в целях реализации функций раздела центр​  ​ развития​  ​ карьеры.
                <br />
                <br />
                <br />


                11.​ ЭКСПЕРТЫ
                <br />
                11.1. Раздел эксперты предназначен для Пользователей, желающих стать частью команды Администратора.
                <br />
                11.2. Пользователю, желающему присоединиться к команде Администратора, необходимо  заполнить​  ​ форму​  ​ обратной​  ​ связи​  ​ по​  ​ сетевому​  ​ адресу​ https://netology.ru/experts​.
                <br />
                11.3 Администратор оставляет за собой право не отвечать на заявку Пользователя, направленную через​  ​ раздел​  ​ эксперты.
                <br />
                11.4. Администратор присваивает Пользователю статус Эксперта по своему усмотрению и только после​  ​ успешного​  ​ результата​  ​ рассмотрения​  ​ заявки.
                <br />
                <br />
                <br />


                12.​  ​ СТИМУЛИРУЮЩИЕ​  ​ МЕРОПРИЯТИЯ.​  ​ ПАРТНЕРЫ
                <br />
                12.1. Администратор вправе проводить любые стимулирующие мероприятия (в любой форме и с применением любых технологий), размещая информацию о таких мероприятиях на любых  страницах​  ​ и​  ​ в​  ​ любых​  ​ разделах​  ​ Сайта​  ​ по​  ​ своему​  ​ усмотрению.
                <br />
                12.2. В разделе личного кабинета “Подарки”, расположенном по сетевому адресу https://netology.ru/student/gifts​ , Партнеры Администратора вправе размещать свои предложения о продаже товаров и/или оказании услуг Пользователям. Партнеры вправе размещать, в том числе, льготные предложения, предназначенные только для Пользователей. Администратор не несет какой-либо ответственности за содержание предложений Партнеров о продаже товаров и/или оказании​  ​ услуг​  ​ Пользователям,​  ​ а​  ​ также​  ​ не​  ​ отвечает​  ​ за​  ​ качество​  ​ таких​  ​ товаров/услуг.
                <br />
                <br />
                <br />


                13​ .​  ​ ФИНАНСОВЫЕ​  ​ УСЛОВИЯ
                <br />
                13.1. Администратор предоставляет доступ без взимания платы к бесплатным занятиям, к материалам в разделе Статьи, к предложениям Партнеров, к функционалу разделов Центр развития карьеры и Эксперты, а также ко всем иным функциональным возможностям Сайта, в описании которых отсутствует или из сути которых не предполагается взимание какой-либо платы за​  ​ использование.
                <br />
                13.2. Администратор устанавливает стоимость каждой программы обучения путем публикации такой стоимости на странице с описанием этой программы обучения. Администратор вправе изменять стоимость программы обучения в любое время по своему усмотрению. При этом стоимость такой программы обучения, уже оплаченная Пользователем, не меняется ни в сторону увеличения, ни в сторону уменьшения. Новая цена распространяется на правоотношения Администратора​  ​ и​  ​ Пользователя,​  ​ возникшие​  ​ после​  ​ ее​  ​ изменения.
                <br />
                13.3. Администратор устанавливает стоимость видеокурса путем публикации такой стоимости на соответствующей странице Сайта. Администратор вправе изменять стоимость видеокурса в любое время по своему усмотрению. При этом стоимость такого видеокурса, уже оплаченная Пользователем, не меняется ни в сторону увеличения, ни в сторону уменьшения. Новая цена распространяется на правоотношения Администратора и Пользователя, возникшие после ее изменения.
                <br />
                13.4. Администратор вправе предоставлять отдельным Пользователям скидки на оплату стоимости программ обучения или видеокурсов. Размер скидки, порядок и условия ее предоставления  Администратор​  ​ устанавливает​  ​ по​  ​ своему​  ​ усмотрению.
                <br />
                13.5. Администратор вправе оказывать Пользователю любые дополнительные услуги без взимания отдельной​  ​ платы.
                <br />
                <br />
                <br />


                ПОРЯДОК​  ​ ОПЛАТЫ​  ​ ПРОГРАММЫ​  ​ ОБУЧЕНИЯ
                13.6. По общему правилу приобретение Пользователем доступа к программе обучения осуществляется на условиях предоплаты в размере полной стоимости программы обучения, за исключением​  ​ случаев,​  ​ предусмотренных​  ​ в​  ​ п.13.13.​  ​ Соглашения.
                <br />
                13.7. В зависимости от даты совершения оплаты программы обучения стоимость программы обучения может изменяться. Информация об актуальной стоимости указывается на странице соответствующей​  ​ программы​  ​ обучения.
                <br />
                13.8. На странице программы обучения Пользователь имеет возможность зарегистрироваться на программу обучения, введя достоверные данные (имя, фамилия, номер телефона, адрес электронной​  ​ почты),​  ​ указав,​  ​ кто​  ​ будет​  ​ производить​  ​ оплату​  ​ (Пользователь​  ​ или​  ​ юридическое​  ​ лицо).
                <br />
                <br />
                13.9. Если Пользователь указал, что оплата будет производиться Пользователем, то в открывшемся окне Пользователь выбирает способ оплаты (систему платежей) и совершает действия, предусмотренные правилами соответствующих электронных систем платежей и процессинговых компаний. Моментом оплаты в этом случае считается момент положительного результата​  ​ авторизации​  ​ платежа​  ​ в​  ​ выбранной​  ​ системе​  ​ платежей.
                <br />
                13.10. Пользователь также имеет возможность произвести оплату выбранной программы обучения по реквизитам, указанным в сообщении, направленном Администратором после совершения Пользователем указанных в пункте 13.8. Соглашения действий на указанный в форме регистрации на программу обучения адрес электронной почты. В названном сообщении также содержится ссылка на образец квитанции на оплату программы обучения. В указанном случае оплата производится банковским переводом денежных средств в российских рублях по реквизитам, указанным в сообщении и/или квитанции в течение срока действия стоимости программы обучения в​  ​ соответствии​  ​ с​  ​ пунктом​  ​ 13.7.​  ​ Соглашения.
                <br />
                13.11. Если Пользователь указал, что оплата будет производиться юридическим лицом, то Пользователь направляет Администратору информацию, которую Администратор запросил у Пользователя в письме, направленном Пользователю после перехода по ссылке «Записаться». Пользователь направляет указанную в запросе информацию Администратору по адресу и  способом,​  ​ указанным​  ​ в​  ​ том​  ​ же​  ​ письме. Юридическое лицо, производящее оплату за Пользователя, должно направить Администратору заявление об акцепте оферты, расположенной по адресу ​ https://netology.ru/legal​ , после чего Администратор​  ​ направляет​  ​ Пользователю​  ​ и/или​  ​ такому​  ​ юридическому​  ​ лицу​  ​ счет​  ​ на​  ​ оплату.
                Оплата производится в российских рублях путем перечисления денежных средств на расчетный счет Администратора, указанный в присланном Пользователю счете в срок, указанный в том же счете. Моментом оплаты считается момент поступления денежных средств на расчетный счет Администратора.
                <br />
                13.12. Пользователь вправе единовременно приобрести и оплатить как одну программу обучения, так​  ​ и​  ​ несколько,​  ​ а​  ​ именно​  ​ 3​  ​ (три)​  ​ или​  ​ 5​  ​ (пять).
                При приобретении единовременно 3 (трех) программ обучения Пользователь вправе выбрать любые​  ​ три​  ​ программы​  ​ обучения​  ​ и​  ​ пройти​  ​ обучение​  ​ по​  ​ ним​  ​ в​  ​ течение​  ​ 1​  ​ (одного)​  ​ года​  ​ со​  ​ дня​  ​ оплаты.
                При приобретении единовременно 5 (пяти) программ обучения Пользователь вправе выбрать любые пять программ обучения и пройти обучение по ним в течение 18 (восемнадцати) месяцев со дня​  ​ оплаты.
                <br />
                13.13. В случае, когда Пользователь производит оплату программы обучения от своего имени и за свой счет (п.13.9. Соглашения), Администратор по желанию Пользователя предоставляет последнему​  ​ рассрочку​  ​ оплаты​  ​ либо​  ​ Пользователь​  ​ может​  ​ оплатить​  ​ программу​  ​ обучения​  ​ в​  ​ кредит.
                Условия​  ​ предоставления​  ​ рассрочки​  ​ оплаты:
                <br />
                предоставляется как при условии оплаты Пользователем одной программы обучения, так и при условии единовременной оплаты Пользователем 3 (трех) или 5 (пяти) программ обучения на условиях,​  ​ предложенных​  ​ Администратором;
                в случае оплаты одной программы обучения Пользователь обязан оплатить 50% от ее стоимости до даты старта, указанной на странице соответствующей программы обучения на Сайте. Оставшиеся 50% от стоимости программы обучения Пользователь должен оплатить в течение 2 (двух)​  ​ недель​  ​ со​  ​ дня,​  ​ следующего​  ​ за​  ​ днем​  ​ оплаты​  ​ первых​  ​ 50%;
                в случае единовременной оплаты 3 (трех) или 5 (пяти) программ обучения Пользователь обязан оплатить 50% от совокупной стоимости соответствующих программ до даты старта первой программы, указанной на странице соответствующей программы обучения на Сайте. Оставшиеся 50% от совокупной стоимости соответствующих программ обучения Пользователь должен оплатить​  ​ в​  ​ течение​  ​ 1​  ​ (одного)​  ​ месяца​  ​ со​  ​ дня,​  ​ следующего​  ​ за​  ​ днем​  ​ оплаты​  ​ первых​  ​ 50%.
                Условия​  ​ предоставления​  ​ кредита:
                <br />
                предоставляется​  ​ только​  ​ при​  ​ условии​  ​ оплаты​  ​ Пользователем​  ​ одной​  ​ программы​  ​ обучения;
                предоставляется​  ​ на​  ​ условиях,​  ​ предложенных​  ​ банком-партнером​  ​ Администратора;
                Администратор не несет ответственности за условия предоставления банком-партнером Пользователю​  ​ кредита,​  ​ а​  ​ также​  ​ за​  ​ отказ​  ​ банка-партнера​  ​ в​  ​ предоставлении​  ​ Пользователю​  ​ кредита;
                для получения кредита Пользователю необходимо до того, как он нажмет кнопку «Записаться» на странице соответствующей программы обучения, проставить галочку в поле «Оплатить в кредит», после чего Пользователь будет автоматически перенаправлен на сайт банка-партнера,​  ​ предоставляющего​  ​ кредит.
                <br />

                <br />
                <br />
                <br />

                ПОРЯДОК​  ​ ОПЛАТЫ​  ​ ВИДЕОКУРСОВ
                13.14. На странице соответствующего видеокурса Пользователь имеет возможность оплатить доступ​  ​ к​  ​ одному​  ​ видеокурсу.​  ​ Доступ​  ​ к​  ​ каждому​  ​ видеокурсу​  ​ оплачивается​  ​ отдельно.
                <br />
                13.15. После последовательного нажатия Пользователем кнопок “Купить доступ к курсу” и “Купить курс за 490 ” на странице соответствующего видеокурса, Пользователь автоматически перенаправляется на страницу оплаты и после выбора сервиса для оплаты совершает действия, предусмотренные правилами соответствующих электронных систем платежей и процессинговых компаний. Моментом оплаты в этом случае считается момент положительного результата авторизации​  ​ платежа​  ​ в​  ​ выбранной​  ​ системе​  ​ платежей.
                <br />
                13.16. Корпоративный пользователь вправе оформить заказ на доступ к курсам для Конечных потребителей в количестве от 5 (пяти) до 50 (пятидесяти) человек на срок 3 (три), 6 (шесть) или 12 (двенадцать) месяцев. По завершению выбора количества сотрудников и срока предоставления доступа к курсам Корпоративному пользователю становится доступна стоимость такого доступа. После оформления заказа Администратор направляет Корпоративному пользователю на указанный им в Личном кабинете адрес электронной почты сообщение о подтверждении заказа. Порядок оплаты согласовывается Корпоративным пользователем с Администратором посредством обмена​  ​ сообщениями​  ​ по​  ​ электронной​  ​ почте.
                <br />
                <br />
                <br />


                14.​  ​ ИНТЕЛЛЕКТУАЛЬНАЯ​  ​ СОБСТВЕННОСТЬ​  ​ И​  ​ ОГРАНИЧЕНИЯ​  ​ ПРИ​  ​ ПОЛЬЗОВАНИИ​  ​ САЙТОМ
                <br />
                14.1. Используя Сайт, Пользователь признает и соглашается с тем, что все без изъятий  содержимое Сайта (в том числе, но не ограничиваясь: аудиовизуальные произведения, текстовые и графические материалы, программы для ЭВМ, товарные знаки/знаки обслуживания, логотипы),  структура содержимого Сайта, программный код Сайта и/или его частей являются результатами интеллектуальной деятельности, исключительное право на которые в полном объеме принадлежит  Администратору. Исключительное право а также иные интеллектуальные права (если применимо) на вышеуказанные результаты интеллектуальной деятельности не переходят к Пользователю в результате​  ​ пользования​  ​ Сайтом​  ​ и​  ​ заключения​  ​ Соглашения.
                <br />
                14.2. Регистрируясь на сайте, подавая заявку Администратору на публикацию материалов в разделе Статьи и отправляя любые материалы на проверку и согласование Администратору, Автор безвозмездно передает (отчуждает) исключительное право на любые такие материалы Администратору в полном объеме. В данном случае правоотношения Автора и Администратора  регулируются положениями Гражданского кодекса Российской Федерации о договоре об отчуждении исключительного права. Исключительное право на материал переходит к Администратору​  ​ с​  ​ момента​  ​ публикации​  ​ Администратором​  ​ такого​  ​ материала​  ​ в​  ​ разделе​  ​ Статьи.
                При этом Автор признает и подтверждает, что с момента перехода к Администратору исключительного права на материал Администратор вправе распространять, копировать, перерабатывать и иным образом неограниченно использовать материал и/или его части по своему усмотрению.
                Автор и Администратор также понимают и признают, что право авторства, а также иные  неимущественные​  ​ интеллектуальные​  ​ права​  ​ на​  ​ материал​  ​ неотчуждаемы​  ​ и​  ​ принадлежат​  ​ Автору.
                <br />
                14.3. Пользователю запрещается копировать, модифицировать, изменять, удалять, дополнять,  публиковать, передавать содержащиеся на Сайте результаты интеллектуальной деятельности, создавать производные работы, изготавливать или продавать товары/оказывать услуги на их основе, воспроизводить, отображать или любым другим образом эксплуатировать или использовать такие результаты интеллектуальной деятельности без прямого разрешения  Администратора.
                При цитировании материалов Сайта, если это прямо предусмотрено функциями Сайта, Пользователь​  ​ обязуется​  ​ указывать​  ​ ссылку​  ​ на​  ​ Сайт.
                <br />
                14.4.​  ​ Во​  ​ избежание​  ​ сомнений,​  ​ Пользователю​  ​ запрещается:
                <br />
                - копировать и/или распространять какую-либо информацию (включая части и компоненты занятий по программе обучения, видеокурсов, статей, логотипов и товарных знаков/знаков обслуживания), полученную на Сайте, кроме случаев, когда такая функция прямо предусмотрена на​  ​ Сайте​  ​ (например,​  ​ “Поделиться”/​  ​ “Сделать​  ​ репост”);
                <br />
                - использовать информацию, полученную на Сайте, для осуществления коммерческой деятельности, извлечения прибыли, либо для использования любым противоречащим закону способом, за исключением навыков, приобретенных на основе полученной в соответствии с Соглашением​  ​ информации;
                <br />
                - копировать, либо иным способом использовать программную часть (программный код или  часть​  ​ кода)​  ​ Сайта,​  ​ а​  ​ также​  ​ его​  ​ дизайн;
                <br />
                - размещать на Сайте персональные данные третьих лиц без их согласия, в том числе, но не ограничиваясь:​  ​ домашние​  ​ адреса,​  ​ телефоны,​  ​ паспортные​  ​ данные,​  ​ адреса​  ​ электронной​  ​ почты;
                <br />
                - размещать на Сайте коммерческую рекламу, коммерческие предложения, агитационную информацию и любую другую навязчивую информацию, кроме случаев, когда размещение такой информации​  ​ прямо​  ​ согласовано​  ​ с​  ​ Администратором;
                <br />
                - изменять каким бы то ни было способом программную часть Сайта, совершать действия, направленные​  ​ на​  ​ изменение​  ​ функционирования​  ​ и​  ​ работоспособности​  ​ Сайта;
                <br />
                - оскорблять и иным образом нарушать права и свободы других пользователей Сайта, третьих​  ​ лиц,​  ​ а​  ​ также​  ​ групп​  ​ лиц;
                <br />
                - использовать нецензурную брань, осуществлять либо распространять информацию, содержащую призывы к массовым беспорядкам, осуществлению экстремистской деятельности, участию в массовых (публичных) мероприятиях, проводимых с нарушением установленного порядка, распространять информацию, необходимую для получения результатов интеллектуальной​  ​ деятельности.
                <br />


                15.​  ​ ПЕРСОНАЛЬНЫЕ​  ​ ДАННЫЕ​  ​ И​  ​ ИХ​  ​ ИСПОЛЬЗОВАНИЕ
                <br />
                15.1. Цель, порядок, сроки и иные существенные условия, при которых Администратор обрабатывает персональные данные Пользователей, определены в Политике Администратора по обработке​  ​ персональных​  ​ данных,​  ​ расположенной​  ​ по​  ​ сетевому​  ​ адресу​ https://netology.ru/legal​.
                <br />
                <br />
                <br />


                16.​  ​ ОТВЕТСТВЕННОСТЬ
                <br />
                16.1. В случае нарушения Пользователем условий Соглашения, законодательства Российской  Федерации, норм морали и нравственности, либо технических требований Администратор вправе заблокировать или удалить личный кабинет, запретить либо ограничить доступ по учетным данным Пользователя к определенным или всем функциям Сайта, программам обучения, курсам, бесплатным​  ​ занятиям.
                <br />
                16.2. В случае нарушения Пользователем порядка оплаты, установленного разделом 13 Соглашения, Администратор вправе по своему усмотрению полностью заблокировать доступ  Пользователя к программам обучения со дня, следующего за днем просрочки оплаты, расторгнуть в одностороннем порядке договор об оказании платных образовательных услуг и возвратить Пользователю излишне уплаченные денежные средства пропорционально количеству занятий, доступных​  ​ Пользователю​  ​ в​  ​ личном​  ​ кабинете.
                <br />
                16.3. При выявлении случаев предоставления Пользователем доступа к личному кабинету третьим лицам, Администратор по своему выбору применяет меры, предусмотренные пунктом 16.1. Соглашения. При этом Администратор вправе полностью заблокировать доступ Пользователя к личному кабинету, программам обучения и курсам, в том числе, заранее оплаченным Пользователем.
                <br />
                16.4. Нарушение Пользователем условий Соглашения, повлекшее неблагоприятные последствия для Администратора (ущерб, административная и иная ответственность, предупреждения правоохранительных и иных органов исполнительной власти, претензии третьих лиц), является основанием для Администратора прекратить доступ Пользователя к видеокурсу, при этом  денежные средства в счет оплаты курса возврату не подлежат и являются штрафом за действия Пользователя. Аналогичные меры могут быть применены Администратором в отношении программы​  ​ обучения.
                <br />
                16.5. В случае нарушения Пользователем интеллектуальных прав Администратора, а также ограничений по использованию Сайта, указанных в разделе 14 Соглашения, Администратор вправе в любой момент без предупреждения заблокировать такому Пользователю полность или частично доступ на Сайт и в Личный кабинет, а также, по своему усмотрению, обратиться к соответствующему Пользователю с требованием об устранении нарушений и/или потребовать устранить​  ​ нарушения​  ​ в​  ​ судебном​  ​ порядке.
                <br />
                16.6. Администратор не отвечает за работоспособность Сайта и не гарантирует его бесперебойной работы. Администратор также не гарантирует сохранности информации, размещенной на Сайте и возможности​  ​ бесперебойного​  ​ доступа​  ​ к​  ​ программам​  ​ обучения,​  ​ курсам​  ​ и​  ​ иным​  ​ материалам.
                <br />
                16.7. Пользователь использует Сайт в том виде, в каком он представлен, на собственный риск. Администратор не гарантирует Пользователю достижения каких-либо результатов вследствие использования​  ​ Сайта.
                <br />
                <br />
                <br />


                17.​  ​ ОСОБЫЕ​  ​ УСЛОВИЯ
                <br />
                17.1. Сайт может содержать ссылки на другие сайты в сети Интернет (сайты третьих лиц). Указанные третьи лица и содержание их сайтов/контента не проверяются Администратором на соответствие тем или иным требованиям (достоверности, полноты, законности и т.п.).  Администратор не несет ответственности за любую информацию, материалы, размещенные на сайтах третьих лиц, к которым Пользователь получает доступ с использованием Сайта, в том числе, за любые мнения или утверждения, выраженные на сайтах третьих лиц, рекламу и т.п., а также​  ​ за​  ​ доступность​  ​ таких​  ​ сайтов​  ​ или​  ​ контента​  ​ и​  ​ последствия​  ​ их​  ​ использования​  ​ Пользователем.
                <br />
                17.2. Администратор не гарантирует, что Сайт соответствует требованиям Пользователя, что доступ​  ​ к​  ​ Сайту​  ​ будет​  ​ предоставляться​  ​ непрерывно,​  ​ быстро,​  ​ надежно​  ​ и​ без​  ​ ошибок.
                <br />
                17.3. Программно-аппаратные ошибки как на стороне Администратора, так и на стороне Пользователя, приведшие к невозможности получения Пользователем доступа к Сайту и/или видеокурсам и программам обучения, являются обстоятельствами непреодолимой силы и  основанием освобождения от ответственности за неисполнение обязательств Администратором по Соглашению.
                <br />
                <br />
                <br />


                18.​  ​ ПОРЯДОК​  ​ РАЗРЕШЕНИЯ​  ​ СПОРОВ
                <br />
                18.1. Все споры, разногласия и претензии, которые могут возникнуть в связи с заключением,  исполнением, изменением, расторжением или признанием недействительным Соглашения,  Стороны будут стремиться решить путем переговоров. Сторона, у которой возникли претензии и/или разногласия, направляет другой Стороне сообщение с указанием возникших претензий и/или разногласий.
                Сообщение Пользователя о возникших претензиях и/или разногласиях должно быть направлено Пользователем Администратору по электронному адресу ​ complaint@netology-group.ru​ , а также продублировано в письменном виде по адресу Администратора, указанному в настоящем Соглашении.
                Сообщение Администратора о возникших претензиях и/или разногласиях направляется Администратором Пользователю по электронному адресу Пользователя, указанному при  регистрации​  ​ на​  ​ Сайте,​  ​ либо​  ​ иным​  ​ образом,​  ​ позволяющим​  ​ зафиксировать​  ​ факт​  ​ отправки.
                <br />
                18.2. В случае, если ответ на сообщение не будет получен направившей сообщение Стороной в течение 30 (тридцати) рабочих дней с даты направления соответствующего сообщения, либо если  Стороны не придут к соглашению по возникшим претензиям и/или разногласиям, спор подлежит разрешению​  ​ в​  ​ судебном​  ​ порядке​  ​ по​  ​ месту​  ​ нахождения​  ​ Администратора.
                <br />
                <br />
                <br />


                19.​  ​ ИЗМЕНЕНИЕ​  ​ УСЛОВИЙ​  ​ СОГЛАШЕНИЯ
                <br />
                19.1. Администратор вправе в любой момент по своему усмотрению в одностороннем порядке изменять условия Соглашения, при этом такие изменения вступают в силу в момент опубликования новой​  ​ версии​  ​ Соглашения​  ​ на​  ​ Сайте.
                <br />
                19.2. При каждом последующем посещении Сайта до начала пользования Личным кабинетом и/или иными функциональными возможностями Сайта Пользователь обязуется знакомиться с новой версией Соглашения. Продолжение использования Сайта и Личного кабинета будет означать согласие​  ​ Пользователя​  ​ с​  ​ условиями​  ​ новой​  ​ версии​  ​ Соглашения.
                <br />
                19.3. Если Пользователь не согласен с условиями новой версии Соглашения, он обязан прекратить пользоваться​  ​ Сайтом.
                <br />
                19.4. В том случае, если Пользователь оплатил программы обучения и видеокурс, но не согласен с новой версией Соглашения, то такой Пользователь обязан уведомить об этом Администратора, отправив сообщение на адрес электронной почты ​ complaint@netology-group.ru​ . В этом случае Пользователь может завершить оплаченные программы обучения и использовать видеокурсы до их завершения. По завершении оплаченных программ обучения и видеокурсов Пользователь  обязан прекратить пользоваться Сайтом или согласиться с новой версией Соглашения. При этом продолжение использования Личного кабинета иных функциональных возможностей Сайта будет означать​  ​ принятие​  ​ Пользователем​  ​ условий​  ​ новой​  ​ версии​  ​ Соглашения.
                <br />
                <br />
                <br />


                20.​  ​ ЗАКЛЮЧИТЕЛЬНЫЕ​  ​ ПОЛОЖЕНИЯ
                <br />
                20.1. Соглашение и все возникающие из него правоотношения регулируются законодательством Российской Федерации с учетом его коллизионных норм. Все возникающие споры разрешаются в  соответствии​  ​ с​  ​ законодательством​  ​ Российской​  ​ Федерации.
                <br />
                20.2. Признание судом какого-либо положения Соглашения недействительным или не подлежащим принудительному​  ​ исполнению​  ​ не​  ​ влечет​  ​ недействительности​  ​ иных​  ​ положений​  ​ Соглашения.
                <br />
                20.3. Бездействие со стороны Администратора в случае нарушения кем-либо из Пользователей положений Соглашения не лишает Администратора права предпринять позднее соответствующие действия в защиту своих интересов и защиту интеллектуальных прав на охраняемые в соответствии с законодательством результаты интеллектуальной деятельности, размещенные на Сайте.
                <br />
                20.4. Пользователь подтверждает, что ознакомился со всеми положениями Соглашения, понимает  и​  ​ принимает​  ​ их.
            </div>
        </div>
    )
}

export default Oferta;

